Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Если Не Объект.Ссылка.Пустая() Тогда
		 ЦенаПродажи = РаботаСЦенами.ПолучитьЦенуПродажи(Объект.Ссылка);
	 КонецЕсли;
 КонецПроцедуры   
 
 &НаКлиенте
 Процедура ИзменитьЦену(Команда)
	 Если Объект.Ссылка.Пустая() Тогда 
		 Сообщить("Перед установкой цены необходимо записать документ!");
	 Иначе     
		 ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСозданияЦены",Новый Структура("Номенклатура", Объект.Ссылка),,,,, Новый ОписаниеОповещения("ПослеИзмененияЦены", ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	 КонецЕсли;
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ПослеИзмененияЦены(Результат, ДополнительныеПараметры) Экспорт    
	 ЦенаПродажи =  РаботаСЦенами.ПолучитьЦенуПродажи(Объект.Ссылка);
 КонецПроцедуры
 
 &НаКлиенте
 Процедура СчетБухгалтерскогоУчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 
	 СписокДоступныхЗначений = Новый СписокЗначений;
	 Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		 СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары"));
	 ИначеЕсли Объект.ТипНоменклатуры = Предопределенноезначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		 СписокДоступныхЗначений.Добавить(Предопределенноезначение("ПланСчетов.Хозрасчетный.Материалы"));
	 ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		 СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу"));
		 СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы"));
	 Иначе 
		 СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка"));
	 КонецЕсли;
	 ДанныеВыбора = СписокДоступныхЗначений;
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ТипНоменклатурыПриИзменении(Элемент)
	 Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		 УстановитьПараметрыВыбора( ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Материалы"));
		 Объект.СчетБухгалтерскогоУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Материалы");  	
	 ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		 Объект.СчетБухгалтерскогоУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары");
		 УстановитьПараметрыВыбора(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары"));
	 ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		 Объект.СчетБухгалтерскогоУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу");
		 УстановитьПараметрыВыбора(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу"));	 
	 КонецЕсли;
 КонецПроцедуры
 
&НаКлиенте
Процедура УстановитьПараметрыВыбора(Счет) 
	 
	НовыйМассив = Новый Массив();  
	НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",Счет));
	НовыйПараметр = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.СчетБухгалтерскогоУчета.ПараметрыВыбора = НовыйПараметр;	

КонецПроцедуры
